dmsComponentsTest/src/main/resources/requests/requestPartyAuthorizations.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://party.core.ecf/AuthorizationManagementServiceSOAP/v2/" xmlns:ns="http://cmm.core.ecf/BaseTypes/cmmServiceTypes/party/2017/02/02/" xmlns:ns1="http://party.core.ecf/messages/2017/02/02/" xmlns:ns2="http://cmm.core.ecf/BaseTypes/cmmPartyTypes/party/2017/02/02/">
   <soapenv:Header/>
   <soapenv:Body>
      <v2:requestPartyAuthorizations>
         <partyAuthorizationsRequest>
            <ns:id>123</ns:id>
            <ns1:partyIdentification>
               <ns2:type>1</ns2:type>
               <ns2:number>GB666673196000</ns2:number>
            </ns1:partyIdentification>
            <ns1:referenceDate>2020-01-14T00:00:00.000Z</ns1:referenceDate>
         </partyAuthorizationsRequest>
      </v2:requestPartyAuthorizations>
   </soapenv:Body>
</soapenv:Envelope>